# Docker-команда FROM указывает базовый образ контейнера
# Наш базовый образ - это Linux с предустановленным python-3.10
FROM python:3.10
# Установим переменную окружения
ENV APP_HOME /main
# Установим рабочую директорию внутри контейнера
WORKDIR $APP_HOME
# Скопируем остальные файлы в рабочую директорию контейнера
COPY . $APP_HOME
# Установим зависимости внутри контейнера
RUN pip install -e .
# Обозначим порт где работает приложение внутри контейнера
#EXPOSE 5000 - у даному випадку порт непотрібен, так як це не веб додаток
# Запустим наше приложение внутри контейнера
ENTRYPOINT ["best_bot"]